[
    {
        "title": "Guardians of the Galaxy Vol. 2",
        "url": "https://movie.thepan.cn/details.php?id=1",
        "image": "images/guardians2.jpg",
        "year": "2017",
        "story": "The Guardians must fight to keep their newfound family together as they unravel the mystery of Peter Quill’s true parentage."
    },
    {
        "title": "Star Wars: The Force Awakens",
        "url": "https://movie.thepan.cn/details.php?id=15",
        "image": "images/force.jpg",
        "year": "2015",
        "story": "Three decades after the Empire’s defeat, a new threat arises in the militant First Order. Stormtrooper defector Finn and spare parts scavenger Rey are caught up in the Resistance’s search for the missing Luke Skywalker."
    },
    {
        "title": "Colonia",
        "url": "https://movie.thepan.cn/details.php?id=14",
        "image": "images/colonia.jpg",
        "year": "2015",
        "story": "A young woman’s desperate search for her abducted boyfriend that draws her into the infamous Colonia Dignidad, a sect nobody has ever escaped from."
    },
    {
        "title": "Life of Pi",
        "url": "https://movie.thepan.cn/details.php?id=20",
        "image": "images/pi.jpg",
        "year": "2012",
        "story": "A young man who survives a disaster at sea is hurtled into an epic journey of adventure and discovery. While cast away, he forms an unexpected connection with another survivor: a fearsome Bengal tiger."
    },
    {
        "title": "Silver Linings Playbook",
        "url": "https://movie.thepan.cn/details.php?id=21",
        "image": "images/silver.jpg",
        "year": "2012",
        "story": "After a stint in a mental institution, former teacher Pat Solitano moves back in with his parents and tries to reconcile with his ex-wife. Things get more challenging when Pat meets Tiffany, a mysterious girl with problems of her own."
    },
    {
        "title": "Co Ba Sai Gon",
        "url": "https://movie.thepan.cn/details.php?id=22",
        "image": "images/cover_default.jpg",
        "year": "2017",
        "story": "Vietnamese dabest"
    },
    {
        "title": "Gravity",
        "url": "https://movie.thepan.cn/details.php?id=19",
        "image": "images/gravity.jpg",
        "year": "2013",
        "story": "Two astronauts work together to survive after an accident which leaves them alone in space."
    },
    {
        "title": "Don Jon",
        "url": "https://movie.thepan.cn/details.php?id=18",
        "image": "images/donjon.jpg",
        "year": "2013",
        "story": "A New Jersey guy dedicated to his family, friends, and church, develops unrealistic expectations from watching porn and works to find happiness and intimacy with his potential true love."
    },
    {
        "title": "Guardians of the Galaxy",
        "url": "https://movie.thepan.cn/details.php?id=17",
        "image": "images/guardians.jpg",
        "year": "2014",
        "story": "A group of intergalactic criminals are forced to work together to stop a fanatical warrior from taking control of the universe."
    },
    {
        "title": "Whiplash",
        "url": "https://movie.thepan.cn/details.php?id=16",
        "image": "images/whiplash.jpg",
        "year": "2014",
        "story": "A promising young drummer enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor who will stop at nothing to realize a student's potential."
    },
    {
        "title": "The Walk",
        "url": "https://movie.thepan.cn/details.php?id=13",
        "image": "images/walk.jpg",
        "year": "2015",
        "story": "In 1974, high-wire artist Philippe Petit recruits a team of people to help him realize his dream: to walk the immense void between the World Trade Center towers."
    },
    {
        "title": "The Revenant",
        "url": "https://movie.thepan.cn/details.php?id=11",
        "image": "images/revenant.jpg",
        "year": "2015",
        "story": "A frontiersman on a fur trading expedition in the 1820s fights for survival after being mauled by a bear and left for dead by members of his own hunting team."
    },
    {
        "title": "Brooklyn",
        "url": "https://movie.thepan.cn/details.php?id=12",
        "image": "images/brooklyn.jpg",
        "year": "2015",
        "story": "An Irish immigrant lands in 1950s Brooklyn, where she quickly falls into a romance with a local. When her past catches up with her, however, she must choose between two countries and the lives that exist within."
    },
    {
        "title": "Trolls",
        "url": "https://movie.thepan.cn/details.php?id=10",
        "image": "images/trolls.jpg",
        "year": "2016",
        "story": "After the Bergens invade Troll Village, Poppy, the happiest Troll ever born, and the curmudgeonly Branch set off on a journey to rescue her friends."
    },
    {
        "title": "Eddie the Eagle",
        "url": "https://movie.thepan.cn/details.php?id=9",
        "image": "images/eddie.jpg",
        "year": "2016",
        "story": "The story of Eddie Edwards, the notoriously tenacious British underdog ski jumper who charmed the world at the 1988 Winter Olympics."
    },
    {
        "title": "Beauty and the Beast",
        "url": "https://movie.thepan.cn/details.php?id=5",
        "image": "images/beauty.jpg",
        "year": "2017",
        "story": "An adaptation of the fairy tale about a monstrous-looking prince and a young woman who fall in love."
    },
    {
        "title": "Arrival",
        "url": "https://movie.thepan.cn/details.php?id=8",
        "image": "images/arrival.jpg",
        "year": "2016",
        "story": "When twelve mysterious spacecraft appear around the world, linguistics professor Louise Banks is tasked with interpreting the language of the apparent alien visitors."
    },
    {
        "title": "Deadpool",
        "url": "https://movie.thepan.cn/details.php?id=7",
        "image": "images/deadpool.jpg",
        "year": "2016",
        "story": "A fast-talking mercenary with a morbid sense of humor is subjected to a rogue experiment that leaves him with accelerated healing powers and a quest for revenge."
    },
    {
        "title": "Hacksaw Ridge",
        "url": "https://movie.thepan.cn/details.php?id=6",
        "image": "images/hacksaw.jpg",
        "year": "2016",
        "story": "WWII American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people, and becomes the first man in American history to receive the Medal of Honor without firing a shot."
    },
    {
        "title": "Okja",
        "url": "https://movie.thepan.cn/details.php?id=4",
        "image": "images/okja.jpg",
        "year": "2017",
        "story": "Meet Mija, a young girl who risks everything to prevent a powerful, multi-national company from kidnapping her best friend - a fascinating animal named Okja."
    },
    {
        "title": "Logan",
        "url": "https://movie.thepan.cn/details.php?id=3",
        "image": "images/logan.jpg",
        "year": "2017",
        "story": "In the near future, a weary Logan cares for an ailing Professor X, somewhere on the Mexican border. However, Logan’s attempts to hide from the world, and his legacy, are upended when a young mutant arrives, pursued by dark forces."
    },
    {
        "title": "Dunkirk",
        "url": "https://movie.thepan.cn/details.php?id=2",
        "image": "images/dunkirk.jpg",
        "year": "2017",
        "story": "Allied soldiers from Belgium, the British Empire and France are surrounded by the German army and evacuated during a fierce battle in World War II."
    }
]